<template>
    <div class="bg">  
        <h3>
            <van-icon @click="goback" name="arrow-left" />
            附加保险
        </h3>
        <div class="booking">
           <van-notice-bar
                color="#471a06"
                background="#fff7e1"
                left-icon="info-o"
                >
            购买保险需提供身份证信息，保险生效后不可退订
            </van-notice-bar>
        </div>
        <van-collapse v-model="activeName" accordion>
        <van-collapse-item title="众安携程门票意外险 经济款" name="1">
            <div class="info">
                <div class="insu">
            <h4>
               主要保险项目和保险限额：
            </h4>
            <div class="container">
                意外身故和伤残:100,000元<br>
                医药补偿:10,000元<br>
                住院津贴（最高90天）:30元/天<br>
                高风险运动意外身故、残疾:10,000元<br>
                突发急性病身故补偿:10,000元<br>
            </div>
            <h4>投保规则</h4>
           
            <p>1、投保人需为18周岁以上；</p>
            <p>
                2、被保险人年龄需为0至90周岁且每位被保险人仅限投保一份
                <strong>(注：投保人与被保险人身份证仅支持18位)</strong>
                </p>
                <p>3、本保险产品的保险人为众安在线财产保险股份有限公司（以下简称“众安保险”）；本保险计划的销售区域范围为全国（港、澳、台除外）</p>
            <p>4、本保险产品仅承保被保险人在保险期间内从进入景区开始到离开景区为止发生的保险事故，同时扩展承担被保险人乘坐景区外接送巴士时发生的保险事故责任，但是各项责任的保险金额最高以保单所载金额的10%为限。（注：景区外接送巴士须含在被保险人预定的景区套餐中，出险时提供景区巴士隶属证明和事故证明。）；</p>
            <p>5、 任何年龄未满10周岁的被保险人，如果其以死亡为给付责任的保险金额（包括在所有商业保险公司所购买的保险）超出中国保监会所规定的限额（人民币20万元，航空意外死亡保险金不受此限）；保险公司就超出限额部分不承担保险金给付责任。</p>
            <p>6、71周岁至80周岁的被保险人，其“意外身故及伤残”和“突发急性病身故”两项保障的保险金额为产品列表中对应项目保险金额的一半；81周岁至90周岁的被保险人，其“意外身故及伤残”和“突发急性病身故”两项保障的保险金额为产品列表中对应项目保险金额的四分之一；</p>
            <p>7、本保险产品承保高风险运动，包括但不限于潜水，滑水，滑雪，滑冰，驾驶或乘坐滑翔翼、滑翔伞，跳伞，攀岩运动，探险活动，武术比赛，摔跤比赛，柔道，空手道，跆拳道，马术，拳击，特技表演，驾驶卡丁车，赛马，赛车，各种车辆表演、蹦极；但是本公司按“高风险运动意外身故及伤残”赔付被保险人的保险金额为保险单上所载“意外身故及伤残”项下的保险金额的一部分，而非增加该保险金额。</p>
            <p>8、本保险产品提供24小时紧急救援服务，救援服务热线：400-891-0152；</p>
            <p>9、订立保险合同时，众安保险或其代理人就保险标的或者被保险人的有关情况提出询问的，投保人应当如实告知。投保人故意或者因重大过失未履行前款规定的如实告知义务，足以影响众安保险决定是否同意承保或者提高保险费率的，众安保险有权解除保险合同。具体如实告知义务以及违反义务的后果请参见具体保险产品所适用保险条款中的相关规定。</p>
            </div>
        </div>
            <div class="box">
                <button class="btn">选择</button>
            </div>
        </van-collapse-item>
        
        <van-collapse-item title="众安携程门票意外险 经济款" name="2">
            <div class="info">
                <div class="insu">
            <h4>
               主要保险项目和保险限额：
            </h4>
            <div class="container">
                意外身故和伤残:100,000元<br>
                医药补偿:10,000元<br>
                住院津贴（最高90天）:30元/天<br>
                高风险运动意外身故、残疾:10,000元<br>
                突发急性病身故补偿:10,000元<br>
            </div>
            <h4>投保规则</h4>
           
            <p>1、投保人需为18周岁以上；</p>
            <p>
                2、被保险人年龄需为0至90周岁且每位被保险人仅限投保一份
                <strong>(注：投保人与被保险人身份证仅支持18位)</strong>
                </p>
                <p>3、本保险产品的保险人为众安在线财产保险股份有限公司（以下简称“众安保险”）；本保险计划的销售区域范围为全国（港、澳、台除外）</p>
            <p>4、本保险产品仅承保被保险人在保险期间内从进入景区开始到离开景区为止发生的保险事故，同时扩展承担被保险人乘坐景区外接送巴士时发生的保险事故责任，但是各项责任的保险金额最高以保单所载金额的10%为限。（注：景区外接送巴士须含在被保险人预定的景区套餐中，出险时提供景区巴士隶属证明和事故证明。）；</p>
            <p>5、 任何年龄未满10周岁的被保险人，如果其以死亡为给付责任的保险金额（包括在所有商业保险公司所购买的保险）超出中国保监会所规定的限额（人民币20万元，航空意外死亡保险金不受此限）；保险公司就超出限额部分不承担保险金给付责任。</p>
            <p>6、71周岁至80周岁的被保险人，其“意外身故及伤残”和“突发急性病身故”两项保障的保险金额为产品列表中对应项目保险金额的一半；81周岁至90周岁的被保险人，其“意外身故及伤残”和“突发急性病身故”两项保障的保险金额为产品列表中对应项目保险金额的四分之一；</p>
            <p>7、本保险产品承保高风险运动，包括但不限于潜水，滑水，滑雪，滑冰，驾驶或乘坐滑翔翼、滑翔伞，跳伞，攀岩运动，探险活动，武术比赛，摔跤比赛，柔道，空手道，跆拳道，马术，拳击，特技表演，驾驶卡丁车，赛马，赛车，各种车辆表演、蹦极；但是本公司按“高风险运动意外身故及伤残”赔付被保险人的保险金额为保险单上所载“意外身故及伤残”项下的保险金额的一部分，而非增加该保险金额。</p>
            <p>8、本保险产品提供24小时紧急救援服务，救援服务热线：400-891-0152；</p>
            <p>9、订立保险合同时，众安保险或其代理人就保险标的或者被保险人的有关情况提出询问的，投保人应当如实告知。投保人故意或者因重大过失未履行前款规定的如实告知义务，足以影响众安保险决定是否同意承保或者提高保险费率的，众安保险有权解除保险合同。具体如实告知义务以及违反义务的后果请参见具体保险产品所适用保险条款中的相关规定。</p>
            </div>
        </div>
            <div class="box box1">
                <button class="btn">选择</button>
            </div>
        </van-collapse-item>
        
        
       <van-collapse-item title="众安携程门票意外险 经济款" name="3">
            <div class="info">
                <div class="insu">
            <h4>
               主要保险项目和保险限额：
            </h4>
            <div class="container">
                意外身故和伤残:100,000元<br>
                医药补偿:10,000元<br>
                住院津贴（最高90天）:30元/天<br>
                高风险运动意外身故、残疾:10,000元<br>
                突发急性病身故补偿:10,000元<br>
            </div>
            <h4>投保规则</h4>
           
            <p>1、投保人需为18周岁以上；</p>
            <p>
                2、被保险人年龄需为0至90周岁且每位被保险人仅限投保一份
                <strong>(注：投保人与被保险人身份证仅支持18位)</strong>
                </p>
                <p>3、本保险产品的保险人为众安在线财产保险股份有限公司（以下简称“众安保险”）；本保险计划的销售区域范围为全国（港、澳、台除外）</p>
            <p>4、本保险产品仅承保被保险人在保险期间内从进入景区开始到离开景区为止发生的保险事故，同时扩展承担被保险人乘坐景区外接送巴士时发生的保险事故责任，但是各项责任的保险金额最高以保单所载金额的10%为限。（注：景区外接送巴士须含在被保险人预定的景区套餐中，出险时提供景区巴士隶属证明和事故证明。）；</p>
            <p>5、 任何年龄未满10周岁的被保险人，如果其以死亡为给付责任的保险金额（包括在所有商业保险公司所购买的保险）超出中国保监会所规定的限额（人民币20万元，航空意外死亡保险金不受此限）；保险公司就超出限额部分不承担保险金给付责任。</p>
            <p>6、71周岁至80周岁的被保险人，其“意外身故及伤残”和“突发急性病身故”两项保障的保险金额为产品列表中对应项目保险金额的一半；81周岁至90周岁的被保险人，其“意外身故及伤残”和“突发急性病身故”两项保障的保险金额为产品列表中对应项目保险金额的四分之一；</p>
            <p>7、本保险产品承保高风险运动，包括但不限于潜水，滑水，滑雪，滑冰，驾驶或乘坐滑翔翼、滑翔伞，跳伞，攀岩运动，探险活动，武术比赛，摔跤比赛，柔道，空手道，跆拳道，马术，拳击，特技表演，驾驶卡丁车，赛马，赛车，各种车辆表演、蹦极；但是本公司按“高风险运动意外身故及伤残”赔付被保险人的保险金额为保险单上所载“意外身故及伤残”项下的保险金额的一部分，而非增加该保险金额。</p>
            <p>8、本保险产品提供24小时紧急救援服务，救援服务热线：400-891-0152；</p>
            <p>9、订立保险合同时，众安保险或其代理人就保险标的或者被保险人的有关情况提出询问的，投保人应当如实告知。投保人故意或者因重大过失未履行前款规定的如实告知义务，足以影响众安保险决定是否同意承保或者提高保险费率的，众安保险有权解除保险合同。具体如实告知义务以及违反义务的后果请参见具体保险产品所适用保险条款中的相关规定。</p>
            </div>
        </div>
            <div class="box box1">
                <button class="btn">选择</button>
            </div>
        </van-collapse-item>
        
      <van-collapse-item title="众安携程门票意外险 经济款" name="4">
            <div class="info">
                <div class="insu">
            <h4>
               主要保险项目和保险限额：
            </h4>
            <div class="container">
                意外身故和伤残:100,000元<br>
                医药补偿:10,000元<br>
                住院津贴（最高90天）:30元/天<br>
                高风险运动意外身故、残疾:10,000元<br>
                突发急性病身故补偿:10,000元<br>
            </div>
            <h4>投保规则</h4>
           
            <p>1、投保人需为18周岁以上；</p>
            <p>
                2、被保险人年龄需为0至90周岁且每位被保险人仅限投保一份
                <strong>(注：投保人与被保险人身份证仅支持18位)</strong>
                </p>
                <p>3、本保险产品的保险人为众安在线财产保险股份有限公司（以下简称“众安保险”）；本保险计划的销售区域范围为全国（港、澳、台除外）</p>
            <p>4、本保险产品仅承保被保险人在保险期间内从进入景区开始到离开景区为止发生的保险事故，同时扩展承担被保险人乘坐景区外接送巴士时发生的保险事故责任，但是各项责任的保险金额最高以保单所载金额的10%为限。（注：景区外接送巴士须含在被保险人预定的景区套餐中，出险时提供景区巴士隶属证明和事故证明。）；</p>
            <p>5、 任何年龄未满10周岁的被保险人，如果其以死亡为给付责任的保险金额（包括在所有商业保险公司所购买的保险）超出中国保监会所规定的限额（人民币20万元，航空意外死亡保险金不受此限）；保险公司就超出限额部分不承担保险金给付责任。</p>
            <p>6、71周岁至80周岁的被保险人，其“意外身故及伤残”和“突发急性病身故”两项保障的保险金额为产品列表中对应项目保险金额的一半；81周岁至90周岁的被保险人，其“意外身故及伤残”和“突发急性病身故”两项保障的保险金额为产品列表中对应项目保险金额的四分之一；</p>
            <p>7、本保险产品承保高风险运动，包括但不限于潜水，滑水，滑雪，滑冰，驾驶或乘坐滑翔翼、滑翔伞，跳伞，攀岩运动，探险活动，武术比赛，摔跤比赛，柔道，空手道，跆拳道，马术，拳击，特技表演，驾驶卡丁车，赛马，赛车，各种车辆表演、蹦极；但是本公司按“高风险运动意外身故及伤残”赔付被保险人的保险金额为保险单上所载“意外身故及伤残”项下的保险金额的一部分，而非增加该保险金额。</p>
            <p>8、本保险产品提供24小时紧急救援服务，救援服务热线：400-891-0152；</p>
            <p>9、订立保险合同时，众安保险或其代理人就保险标的或者被保险人的有关情况提出询问的，投保人应当如实告知。投保人故意或者因重大过失未履行前款规定的如实告知义务，足以影响众安保险决定是否同意承保或者提高保险费率的，众安保险有权解除保险合同。具体如实告知义务以及违反义务的后果请参见具体保险产品所适用保险条款中的相关规定。</p>
            </div>
        </div>
            <div class="box box1">
                <button class="btn">选择</button>
            </div>
        </van-collapse-item>
      
        </van-collapse>
    </div>
</template>
<script>
export default {
    data() {
        return {
         activeName: '0',
         list:[3,5,10,15]
        };
    },
    methods:{
        goback(){
            this.$router.go(-1)
        },
    },
     mounted(){
        var par = document.getElementsByClassName("van-cell__title");
        for(var i=0;i<par.length;i++){
            var span = document.createElement("span");
            span.style.float = "right";
            span.innerHTML = `¥${this.list[i]}人`;
            par[i].appendChild(span);
        }
    }
    };
</script>
<style scoped>
h3{
    height:2.75rem;
    line-height:2.75rem;
    border-bottom:1px solid #e4e4e4;
     background-color:#fff;
}
h3 .van-icon{
    position: relative;
    left:-8.125rem;
    top:.1875rem;
    
}
.van-collapse-item{
    text-align:left;
    color:aqua;
    
}
/* .van-collapse-item>span{
    text-align:left;
    color:aqua;
    
} */
h4{
   font-size: .9375rem;
    font-weight: 400;
    color: #666;
    padding:0rem 0rem .5rem;

}
.liu{
   font-size: .95rem;
    color: #ababab; 
    margin: 2.2135rem 0rem;
   
    
}
.booking{
    width: 24rem;
    height: 1.9375rem;
     padding: 2px 15px;
    font-size: 13px;
     line-height: 18px;  
    background: #fff7e1;
}  
.price{
    width:2.1975rem;
    height: 1rem;
    font-size: .8125rem;
}
.price>span{
    margin-right: 2px;
    font-size: 16px;
    color: #ff7d13;
    font-size: 1rem;
}
.container{
    color: #000;
    font-size: .875rem;
}
.info{
    width: 100%;
    height: 23.125rem;
    /* position: relative; */
     padding: 0rem 0rem .625rem;
    background: #efefef;
    overflow-y: auto;
    margin: -1.25rem 0rem 0rem;

}
.insu{
    width: 100%;
    height: 20.0625rem;
    padding: .4375rem 0rem 0rem;
    margin: 0 auto;
}
.box{
    width:21.4375rem;
    height: 3.25rem;
    padding: .5rem 1rem;
    /* border: 1px solid #000; */
    position: absolute;
    bottom:8.75rem;
    z-index: 100px;  
    background:#efefef;
}
.btn{
   width: 100px;
    height: 33px;
    color: #fff;
    font-size: 15px;
    border-radius: 5px;
    background: #ff7d13;
    float: right; 
}
.container{
    padding: 0rem 0rem .625rem;
}
p{
    font-size: .8125rem;
    color: #000;
    margin: 0rem 0rem .3125rem;
}
.box1{
    position:absolute;
    bottom:0rem ;

}
</style>

   
